# Задача 4: Линейный поиск

## Описание

В данной задаче реализуется алгоритм линейного поиска для нахождения индексов всех вхождений заданного элемента в массив. Если элемент не найден, возвращается `-1`.

### Формат входных данных
- Входные данные находятся в файле `input.txt`.
- Первая строка содержит список целых чисел — массив для поиска.
- Вторая строка содержит целое число `v`, которое нужно найти в массиве.

### Формат выходных данных
- В выходном файле `output.txt` должен содержаться список индексов всех вхождений элемента `v` (индексы начинаются с 1), разделённых запятой и пробелом. Если элемент не найден, выводится `-1`.

### Ограничения
- Время выполнения: 2 секунды.
- Память: 256 МБ.

## Код задачи

```python
import time
import tracemalloc

tracemalloc.start()

with open("../txtf/input.txt", "w") as f:
    a = input().split()
    n = input().strip()
    f.write(" ".join(a))
    f.write("\n")
    f.write(n)

start = time.perf_counter()

with open("../txtf/input.txt", "r") as f:
    a = f.readline().split()
    n = f.readline().strip()
    k = 0
    b = []
    for i in range(len(a)):
        if a[i] == n:
            k += 1
            b.append(str(i))

end = time.perf_counter()

with open("../txtf/output.txt", "w") as f:
    if k == 0:
        f.write("-1")
    elif k == 1:
        f.write(b[0])
    elif k > 1:
        f.write(str(k))
        f.write("\n")
        f.write(", ".join(b))

print("Время работы: ", end - start, "секунд")
current, peak = tracemalloc.get_traced_memory()
print(f"Пиковая память: {peak / 2**20:.2f} MB")
tracemalloc.stop()
```

## Запуск проекта

1. Перейдите в директорию `src`.
2. Убедитесь, что файл `input.txt` содержит корректные входные данные в указанном формате.
3. Введите ходные данные в стандартный ввод.
4. Результат выполнения будет записан в файл `output.txt`.

## Пример

### Входные данные (input.txt)
```
10 20 30 40
30
```

### Выходные данные (output.txt)
```
3
```
