# Задача 2: Сортировка слиянием с выводом индексов

## Описание

Данная задача включает реализацию алгоритма сортировки слиянием (Merge Sort) с дополнительной функциональностью — выводом индексов и значений подмассивов при каждом слиянии. Основной целью является продемонстрировать процесс выполнения сортировки и более подробно отслеживать процесс слияния.

### Описание файлов:

- **src/merge_sort_plus.py**: Основной скрипт с реализацией алгоритма сортировки слиянием с выводом индексов подмассивов. Читает данные из файла `input.txt` и записывает отсортированный массив в файл `output.txt`.
- **txtf/input.txt**: Входной файл, содержащий количество элементов и сам массив чисел, который необходимо отсортировать.
- **txtf/output.txt**: Выходной файл, содержащий отсортированный массив.
- **tests/test_merge_sort_plus.py**: Модуль с тестами для проверки корректности работы алгоритма сортировки.

## Код задачи

```python
import time
import tracemalloc

tracemalloc.start()

"""with open ("../txtf/input.txt", "w") as f:
    n = input()
    a = input().split()
    f.write(n)
    f.write("\n")
    f.write(" ".join(a))
"""

start = time.perf_counter()

def merge_sort(arr):
    if len(arr) <= 1:
        return arr

    mid = len(arr) // 2
    left_half = merge_sort(dict(list(arr.items())[:mid]))
    right_half = merge_sort(dict(list(arr.items())[mid:]))

    return merge(left_half, right_half)

def merge(left, right):
    sorted_array = []
    i = j = 0

    l1 = min(list(left.keys()))
    r1 = max(list(right.keys()))

    while i < len(left) and j < len(right):
        if list(left.values())[i] < list(right.values())[j]:
            sorted_array.append([list(left.keys())[i], list(left.values())[i]])
            i += 1
        else:
            sorted_array.append([list(right.keys())[j], list(right.values())[j]])
            j += 1

    while i < len(left):
        sorted_array.append([list(left.keys())[i], list(left.values())[i]])
        i += 1

    while j < len(right):
        sorted_array.append([list(right.keys())[j], list(right.values())[j]])
        j += 1


    f.write(str(l1) + ' ' + str(r1) + ' ' + str(sorted_array[0][1]) + ' ' + str(sorted_array[-1][1]))
    f.write("\n")
    return dict(sorted_array)

with open("../txtf/input.txt", "r") as f:
    n = int(f.readline())
    arr1 = f.readline().split()
    arr = [int(x) for x in arr1]
    with open("../txtf/output.txt", "w") as f:
        inp_arr = []
        for i in range(1, len(arr)+1):
            inp_arr.append([i, arr[i-1]])
        dict_arr = dict(inp_arr)
        sorted_arr = merge_sort(dict_arr)
        res = sorted_arr.values()
        res = [str(x) for x in sorted_arr.values()]
        f.write(" ".join(res))

end = time.perf_counter()

print("Время работы: ", end - start, "секунд")
current, peak = tracemalloc.get_traced_memory()
print(f"Пиковая память: {peak / 2**20:.2f} MB")
tracemalloc.stop()
```

## Как запустить проект

1. **Установка зависимостей**: Проект не требует дополнительных зависимостей, кроме стандартной библиотеки Python.

2. **Запуск алгоритма сортировки**:

   - Перейдите в директорию `Task2/src`.
   - Убедитесь, что файл `input.txt` содержит корректные входные данные. Формат файла:
     - Первая строка содержит число `n` (количество элементов массива).
     - Вторая строка содержит `n` целых чисел, разделенных пробелами.
   - Выполните команду:
     ```sh
     python merge_sort_with_indices.py
     ```
   - Результат будет записан в файл `output.txt`.

3. **Запуск тестов**:

   - Перейдите в директорию `Task2/tests`.
   - Выполните команду:
     ```sh
     python -m unittest test_merge_sort_plus.py
     ```
   - Все тесты должны завершиться успешно, подтверждая корректность работы алгоритма.

## Формат входных и выходных данных

- **Входной файл (********`input.txt`********)**:

  - Первая строка: число `n` ( ≤ `n` ≤ 2 ⋅ 10⁴) — количество элементов массива.
  - Вторая строка: `n` различных целых чисел, по модулю не превосходящих `10⁹`.

- **Выходной файл (********`output.txt`********)**:

  - Содержит одну строку с отсортированным массивом, где элементы разделены пробелами.

## Описание алгоритма

Алгоритм сортировки слиянием состоит из следующих этапов:

1. **Разделение**: Деление массива на две части, пока размер подмассивов не станет равным единице.
2. **Властвование**: Рекурсивная сортировка подмассивов.
3. **Комбинирование**: Слияние двух отсортированных подмассивов в один.

В данной реализации на каждом этапе слияния происходит вывод индексов и значений подмассивов, что позволяет визуализировать процесс выполнения алгоритма.

## Тестирование

Для проверки работоспособности алгоритма реализованы юнит-тесты в файле `test_merge_sort_plus`. Тесты включают:

- Сортировку обычных массивов.
- Проверку на уже отсортированный массив.
- Обратный порядок элементов.
- Пустой массив и массив с одним элементом.
- Проверку на некорректные входные данные.

Запуск тестов позволяет убедиться в корректности работы функции для различных сценариев.

## Примеры

Пример входного файла (`input.txt`):

```
4
9 7 5 8
```

Пример выхода в консоли во время выполнения:

```
Слияние: индексы 1-2, значения: 9-7
Слияние: индексы 3-4, значения: 5-8
Слияние: индексы 1-4, значения: 7-8
```

Пример выходного файла (`output.txt`) после сортировки:

```
5 7 8 9
```
